<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of Mos from Github and imports it into a munki_repo.</string>
    <key>Identifier</key>
    <string>com.github.apizz.munki.Mos</string>
    <key>Input</key>
    <dict>
        <key>MUNKI_CATEGORY</key>
        <string>Utilities</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/mos</string>
        <key>NAME</key>
        <string>Mos</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>category</key>
            <string>%MUNKI_CATEGORY%</string>
            <key>description</key>
            <string>A free &amp; simple app allow your mouse wheel to scroll smoothly on macOS.

**Features**

- Let the mouse wheel scroll smoothly just like using a touchpad.
- Allows customizing scroll behavior, such as the speed and acceleration.
- Allows customizing the scrolling behavior for touchpad and mouse wheel separately.
- Provides an informative graph that shows the scroll events.
- Built in per app blacklist/whitelist support.
- Coded with Swift.</string>
            <key>developer</key>
            <string>Caldis Chen</string>
            <key>display_name</key>
            <string>Mos</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.0</string>
    <key>ParentRecipe</key>
    <string>com.github.apizz.download.Mos</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
