<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Identifier</key>
    <string>com.github.apizz.munki.MakeMKV</string>
    <key>Input</key>
    <dict>
	<key>MUNKI_CATEGORY</key>
	<string>Video</string>
	<key>MUNKI_REPO_SUBDIR</key>
	<string>apps/makemkv</string>
	<key>NAME</key>
	<string>MakeMKV</string>
	<key>pkginfo</key>
	<dict>
	    <key>catalogs</key>
	    <array>
		<string>testing</string>
	    </array>
	    <key>category</key>
	    <string>%MUNKI_CATEGORY%</string>
	    <key>description</key>
	    <string></string>
	    <key>developer</key>
	    <string>GuinpinSoft Inc</string>
	    <key>display_name</key>
	    <string>MakeMKV</string>
	    <key>name</key>
	    <string>%NAME%</string>
	    <key>unattended_install</key>
	    <true/>
	</dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.5.0</string>
    <key>ParentRecipe</key>
    <string>com.github.apizz.download.MakeMKV</string>
    <key>Process</key>
    <array>
        <dict>
    	    <key>Arguments</key>
    	    <dict>
		<key>additional_pkginfo</key>
    	    	<dict>
    		    <key>version</key>
    		    <string>%version%</string>
    	    	</dict>
    	    </dict>
    	    <key>Processor</key>
    	    <string>MunkiPkginfoMerger</string>
    	</dict>
	<dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
