<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of MakeMKV.</string>
    <key>Identifier</key>
    <string>com.github.apizz.download.MakeMKV</string>
    <key>Input</key>
    <dict>
	<key>SEARCH_PATTERN</key>
	<string>(?P&lt;file&gt;makemkv_v(?P&lt;version&gt;[\d\.]+)_osx\.dmg)</string>
	<key>SEARCH_PAGE</key>
	<string>https://www.makemkv.com/download</string>
	<key>NAME</key>
	<string>MakeMKV</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.0</string>
    <key>Process</key>
    <array>
	<dict>
	    <key>Arguments</key>
	    <dict>
		<key>re_pattern</key>
		<string>%SEARCH_PATTERN%</string>
		<key>url</key>
		<string>%SEARCH_PAGE%</string>
	    </dict>
	    <key>Processor</key>
	    <string>URLTextSearcher</string>
	</dict>
	<dict>
	    <key>Arguments</key>
	    <dict>
		<key>filename</key>
		<string>%NAME%.dmg</string>
		<key>url</key>
		<string>%url%/%file%</string>
	    </dict>
	    <key>Processor</key>
	    <string>URLDownloader</string>
	</dict>
	<dict>
	    <key>Processor</key>
	    <string>EndOfCheckPhase</string>
	</dict>
    </array>
</dict>
</plist>
