<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of TigerVNC.</string>
    <key>Identifier</key>
    <string>com.github.apizz.download.TigerVNC</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>TigerVNC</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>re_pattern</key>
                <string>(href="(?P&lt;url&gt;.*TigerVNC-(?P&lt;version&gt;[\d.]+)\.dmg)")</string>
                <key>url</key>
                <string>https://bintray.com/tigervnc/stable/tigervnc/_latestVersion</string>
            </dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>%NAME%-%version%.dmg</string>
                <key>url</key>
                <string>https://bintray.com%url%</string>
            </dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pattern</key>
                <string>%pathname%/TigerVNC*.app</string>
            </dict>
            <key>Processor</key>
            <string>FileFinder</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/%dmg_found_filename%</string>
                <key>requirement</key>
                <string>identifier "com.tigervnc.tigervnc" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = S5LX88A9BW</string>
                <key>strict_verification</key>
                <true/>
            </dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
        </dict>
    </array>
</dict>
</plist>
