<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Identifier</key>
    <string>com.github.apizz.munki.bibliomanuels</string>
    <key>Input</key>
    <dict>
        <key>MUNKI_CATEGORY</key>
		    <string>Software</string>
		    <key>MUNKI_REPO_SUBDIR</key>
		    <string>apps/bibliomanuels</string>
		    <key>NAME</key>
		    <string>BiblioManuels</string>
		    <key>pkginfo</key>
		    <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
			      <key>category</key>
			      <string>%MUNKI_CATEGORY%</string>
			      <key>description</key>
			      <string>Biblio Manuels: Modern, practical, light, your textbooks are now at your fingertips wherever you are! Watch, listen, discover and learn thanks to numerous digital enrichments: audio sequences, videos, animations.  For individual use at home or in class.</string>
			      <key>developer</key>
			      <string>CLE International</string>
			      <key>display_name</key>
			      <string>Biblio Manuels</string>
			      <key>name</key>
			      <string>%NAME%</string>
			      <key>unattended_install</key>
			      <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.0</string>
    <key>ParentRecipe</key>
    <string>com.github.apizz.download.bibliomanuels</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
