<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest FileMaker Pro (Claris) full installer given the supplied PRODUCT_ID.

To use this recipe, go to https://www.filemaker.com/redirects/ss.txt and find the desired product in the list (ex. PRO19MAC). Enter this value for PRODUCT_ID.</string>
    <key>Identifier</key>
    <string>com.github.apizz.download.FileMakerProClaris</string>
    <key>Input</key>
    <dict>
        <key>PRODUCT_ID</key>
        <string>PRO19MAC</string>
        <key>NAME</key>
        <string>FileMakerPro</string>
        <key>SEARCH_PATTERN</key>
        <string>("%PRODUCT_ID%","url":"(?P&lt;url&gt;https://downloads\.claris\.com/[esdTBU\d/]+/fm[sp_trial]+(?P&lt;version&gt;[\d.]+)\.dmg)")</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.6.1</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>re_pattern</key>
                <string>%SEARCH_PATTERN%</string>
                <key>url</key>
                <string>https://www.filemaker.com/redirects/ss.txt</string>
            </dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>%NAME%-%version%.dmg</string>
                <key>url</key>
                <string>%url%</string>
            </dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/*.app</string>
                <key>requirement</key>
                <string>identifier "com.filemaker.client.pro12" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = J6K4T76U7W</string>
                <key>strict_verification</key>
                <true/>
            </dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
        </dict>
    </array>
</dict>
</plist>
