<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest FileMaker Pro Advanced full installer given the supplied MAJOR_VERSION.

In order to automatically download the installer, you need to provide your license key by overriding the FMP_LICENSE_KEY variable, or use the -k option to provide it when running AutoPkg.</string>
	<key>Identifier</key>
	<string>com.github.apizz.download.FileMakerAdvanced</string>
	<key>Input</key>
	<dict>
		<key>FMP_LICENSE_KEY</key>
		<string>XXXXX-XXXXX-XXXXX-XXXXX-XXXXX-XXXXX-XXXXX</string>
		<key>MAJOR_VERSION</key>
		<string>17</string>
		<key>NAME</key>
		<string>FileMakerAdvanced%MAJOR_VERSION%</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.1</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>predicate</key>
				<string>FMP_LICENSE_KEY == "XXXXX-XXXXX-XXXXX-XXXXX-XXXXX-XXXXX-XXXXX"</string>
			</dict>
			<key>Processor</key>
			<string>StopProcessingIf</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>(?P&lt;url&gt;https\:\/\/fmdl\.filemaker\.com\/esd\/fmpa_(?P&lt;version&gt;%MAJOR_VERSION%[\d.]+)\.dmg)</string>
				<key>url</key>
				<string>https://accounts.filemaker.com/software/license/%FMP_LICENSE_KEY%</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%-%version%.dmg</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>expected_authority_names</key>
				<array>
					<string>Developer ID Installer: FileMaker, Inc. (J6K4T76U7W)</string>
					<string>Developer ID Certification Authority</string>
					<string>Apple Root CA</string>
				</array>
				<key>input_path</key>
				<string>%pathname%/FileMaker Pro %MAJOR_VERSION% Advanced.pkg</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
	</array>
</dict>
</plist>
