<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of the TI Connect CE for Mac software and packages it.</string>
    <key>Identifier</key>
    <string>com.github.apizz.pkg.TISmartViewCE</string>
    <key>Input</key>
    <dict>
	<key>NAME</key>
	<string>TISmartViewCE84</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.4.0</string>
    <key>ParentRecipe</key>
    <string>com.github.apizz.download.TISmartViewCE</string>
    <key>Process</key>
    <array>
	<dict>
	    <key>Arguments</key>
	    <dict>
		<key>flat_pkg_path</key>
		<string>%pathname%/TI-SmartView-CE*.pkg</string>
		<key>destination_path</key>
		<string>%RECIPE_CACHE_DIR%/unpack</string>
	    </dict>
	    <key>Processor</key>
	    <string>FlatPkgUnpacker</string>
	</dict>
	<dict>
	    <key>Arguments</key>
	    <dict>
		<key>destination_path</key>
		<string>%RECIPE_CACHE_DIR%/unpack</string>
		<key>pkg_payload_path</key>
		<string>%RECIPE_CACHE_DIR%/unpack/tismartviewCeForTheTi84PlusFamily.pkg/Payload</string>
	    </dict>
	    <key>Processor</key>
	    <string>PkgPayloadUnpacker</string>
	</dict>
	<dict>
	    <key>Arguments</key>
	    <dict>
		<key>input_plist_path</key>
		<string>%RECIPE_CACHE_DIR%/unpack/TI-SmartView CE for the TI-84 Plus Family.app/Contents/Info.plist</string>
		<key>plist_version_key</key>
		<string>CFBundleVersion</string>
	    </dict>
	    <key>Processor</key>
	    <string>Versioner</string>
	</dict>
	<dict>
	    <key>Arguments</key>
	    <dict>
		<key>pkg_path</key>
		<string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
		<key>source_pkg</key>
		<string>%pathname%/TI-SmartView-CE*.pkg</string>
	    </dict>
	    <key>Processor</key>
	    <string>PkgCopier</string>
	</dict>
	<dict>
	    <key>Arguments</key>
	    <dict>
		<key>path_list</key>
		<array>
		    <string>%RECIPE_CACHE_DIR%/unpack</string>
		</array>
	    </dict>
	    <key>Processor</key>
	    <string>PathDeleter</string>
	</dict>
    </array>
</dict>
</plist>
