<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of the TI Connect CE for Mac software.</string>
    <key>Identifier</key>
    <string>com.github.apizz.download.TISmartViewCE</string>
    <key>Input</key>
    <dict>
	<key>NAME</key>
	<string>TISmartViewCE84</string>
	<key>URL</key>
	<string>https://education.ti.com/smartview/downloads/84cemac</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.4.0</string>
    <key>Process</key>
    <array>
	<dict>
	    <key>Arguments</key>
	    <dict>
		<key>url</key>
		<string>%URL%</string>
		<key>filename</key>
		<string>%NAME%.dmg</string>
	    </dict>
	    <key>Processor</key>
	    <string>URLDownloader</string>
	</dict>
	<dict>
	    <key>Arguments</key>
	    <dict>
		<key>expected_authority_names</key>
		<array>
		    <string>Developer ID Installer: Texas Instruments</string>
		    <string>Developer ID Certification Authority</string>
		    <string>Apple Root CA</string>
		</array>
		<key>input_path</key>
		<string>%pathname%/*.pkg</string>
	    </dict>
	    <key>Processor</key>
	    <string>CodeSignatureVerifier</string>
	</dict>
	<dict>
	    <key>Processor</key>
	    <string>EndOfCheckPhase</string>
	</dict>
    </array>
</dict>
</plist>
