<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
   <key>Description</key>
   <string>Downloads the latest Microsoft Teams installer and imports into Munki.</string>
   <key>Identifier</key>
   <string>com.github.apizz.munki.MicrosoftTeams</string>
   <key>Input</key>
   <dict>
      <key>MUNKI_CATEGORY</key>
      <string>Communication</string>
      <key>MUNKI_REPO_SUBDIR</key>
      <string>apps/microsofteams</string>
      <key>NAME</key>
      <string>MicrosoftTeams</string>
      <key>pkginfo</key>
      <dict>
         <key>catalogs</key>
         <array>
            <string>testing</string>
         </array>
         <key>category</key>
         <string>%MUNKI_CATEGORY%</string>
         <key>description</key>
         <string>Microsoft Teams</string>
         <key>developer</key>
         <string>Microsoft</string>
         <key>display_name</key>
         <string>Microsoft Teams</string>
         <key>name</key>
         <string>%NAME%</string>
         <key>unattended_install</key>
         <true/>
      </dict>
   </dict>
   <key>MinimumVersion</key>
   <string>1.0.0</string>
   <key>ParentRecipe</key>
   <string>com.github.apizz.pkg.MicrosoftTeams</string>
   <key>Process</key>
   <array>
      <dict>
         <key>Arguments</key>
         <dict>
            <key>additional_pkginfo</key>
            <dict>
               <key>minimum_os_version</key>
               <string>%min_os_version%</string>
               <key>version</key>
               <string>%version%</string>
            </dict>
         </dict>
         <key>Processor</key>
         <string>MunkiPkginfoMerger</string>
      </dict>
      <dict>
         <key>Arguments</key>
         <dict>
            <key>pkg_path</key>
            <string>%pathname%</string>
            <key>repo_subdirectory</key>
            <string>%MUNKI_REPO_SUBDIR%</string>
         </dict>
         <key>Processor</key>
         <string>MunkiImporter</string>
      </dict>
   </array>
</dict>
</plist>