<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
   <key>Description</key>
   <string>Downloads the latest version of Microsoft's Teams PKG.</string>
   <key>Identifier</key>
   <string>com.github.apizz.pkg.MicrosoftTeams</string>
   <key>Input</key>
   <dict>
      <key>NAME</key>
      <string>MicrosoftTeams</string>
   </dict>
   <key>MinimumVersion</key>
   <string>1.0.0</string>
   <key>ParentRecipe</key>
   <string>com.github.rtrouton.download.microsoftteams</string>
   <key>Process</key>
   <array>
      <dict>
         <key>Arguments</key>
         <dict>
            <key>destination_path</key>
            <string>%RECIPE_CACHE_DIR%/downloads/unpack</string>
            <key>flat_pkg_path</key>
            <string>%pathname%</string>
         </dict>
         <key>Processor</key>
         <string>FlatPkgUnpacker</string>
      </dict>
      <dict>
         <key>Arguments</key>
         <dict>
            <key>pattern</key>
            <string>%RECIPE_CACHE_DIR%/downloads/unpack/*Teams*.pkg</string>
         </dict>
         <key>Processor</key>
         <string>FileFinder</string>
      </dict>
      <dict>
         <key>Arguments</key>
         <dict>
            <key>destination_path</key>
            <string>%RECIPE_CACHE_DIR%/downloads/payload</string>
            <key>pkg_payload_path</key>
            <string>%found_filename%/Payload</string>
         </dict>
         <key>Processor</key>
         <string>PkgPayloadUnpacker</string>
      </dict>
      <dict>
         <key>Arguments</key>
         <dict>
            <key>info_path</key>
            <string>%RECIPE_CACHE_DIR%/downloads/payload/Microsoft Teams.app/Contents/Info.plist</string>
            <key>plist_keys</key>
            <dict>
               <key>CFBundleShortVersionString</key>
               <string>version</string>
               <key>LSMinimumSystemVersion</key>
               <string>min_os_version</string>
            </dict>
         </dict>
         <key>Processor</key>
         <string>PlistReader</string>
      </dict>
      <dict>
         <key>Arguments</key>
         <dict>
            <key>source_pkg</key>
            <string>%pathname%</string>
            <key>pkg_path</key>
            <string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
         </dict>
         <key>Processor</key>
         <string>PkgCopier</string>
      </dict>
      <dict>
         <key>Arguments</key>
         <dict>
            <key>path_list</key>
            <array>
               <string>%RECIPE_CACHE_DIR%/downloads/unpack</string>
               <string>%RECIPE_CACHE_DIR%/downloads/payload</string>
            </array>
         </dict>
         <key>Processor</key>
         <string>PathDeleter</string>
      </dict>
   </array>
</dict>
</plist>