<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of Tuxera NTFS.</string>
    <key>Identifier</key>
    <string>com.github.apizz.download.tuxerantfs</string>
    <key>Input</key>
    <dict>
	<key>DOWNLOAD_PATTERN</key>
	<string>href="(?P&lt;url&gt;https\:\/\/tuxera\.com\/mac\/tuxerantfs_[\d\.]+\.dmg)"</string>
	<key>DOWNLOAD_URL</key>
	<string>https://www.tuxera.com/products/tuxera-ntfs-for-mac/download/</string>
	<key>NAME</key>
	<string>TuxeraNTFS</string>
	<key>USER_AGENT</key>
    <string>Mozilla/5.0 (Macintosh; Intel Mac OS X 10_8_3) AppleWebKit/536.28.10 (KHTML, like Gecko) Version/6.0.3 Safari/536.28.10</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.0</string>
    <key>Process</key>
    <array>
	<dict>
	    <key>Arguments</key>
	    <dict>
		<key>re_pattern</key>
		<string>%DOWNLOAD_PATTERN%</string>
		<key>request_headers</key>
        <dict>
            <key>user-agent</key>
            <string>%USER_AGENT%</string>
        </dict>
		<key>result_output_var_name</key>
		<string>version</string>
		<key>url</key>
		<string>%DOWNLOAD_URL%</string>
	    </dict>
	    <key>Processor</key>
	    <string>URLTextSearcher</string>
	</dict>
	<dict>
	    <key>Arguments</key>
	    <dict>
		<key>filename</key>
		<string>%NAME%.dmg</string>
		<key>url</key>
		<string>%url%</string>
	    </dict>
	    <key>Processor</key>
	    <string>URLDownloader</string>
	</dict>
	<dict>
	    <key>Processor</key>
	    <string>EndOfCheckPhase</string>
	</dict>
	<dict>
	    <key>Arguments</key>
	    <dict>
	        <key>input_path</key>
		<string>%pathname%/Install Tuxera NTFS.app</string>
		<key>requirement</key>
		<string>identifier "com.tuxera.ntfs_for_mac.installer_launcher" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = PPNVCC9Z68</string>
	    </dict>
	    <key>Processor</key>
	    <string>CodeSignatureVerifier</string>
	</dict>
    </array>
</dict>
</plist>
