<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of KensingtonWorks.</string>
    <key>Identifier</key>
    <string>com.github.apizz.download.KensingtonTrackballWorks</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>KensingtonWorks</string>
        <key>USER_AGENT</key>
        <string>Mozilla/5.0 (Macintosh; Intel Mac OS X 10_8_3) AppleWebKit/536.28.10 (KHTML, like Gecko) Version/6.0.3 Safari/536.28.10</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>curl_opts</key>
                <array>
                    <string>-H</string>
                    <string>cookie: ARRAffinity=57c5d9da28c565f11113cef18cb1125dad1a1573576bafc193555d76d449f3a5; ARRAffinitySameSite=57c5d9da28c565f11113cef18cb1125dad1a1573576bafc193555d76d449f3a5; .ASPXANONYMOUS=qanL1YzZxtHTTLHhawcs3X7QCHHS82jg1VtVaGR34XesWI0qa-bMkhsYV9pxknF5-hxpLK7NGNRCULlFP6_0IpWcK0GZuvqrFM-5nUWWOm0oxNMkPdLekwKARh46_ElWroxEInLIJoY3s8L4oCZ7mw2; Country=US; MarketId=US; ClientCountry=US; Language=en; ASP.NET_SessionId=o1iqmvjxgrgubhzvw5nerfop; EPi_NumberOfVisits=1,2022-04-03T23:56:59; DataBrand=KEN; EPiSessionId=9a90f0af-0bbd-40c9-8c3b-fdcc350b2462; _madid=a7bbdc30-2a20-46d9-8af3-078b3cd39d6a; CookieControl={"necessaryCookies":["ASPXANONYMOUS","ASP.NET_SessionId","ARRAffinity","ai_session","ai_user","_madid","EPi_NumberOfVisits","EPiSessionId","ClientCountry","Country","__cfduid","MarketId","DataBrand","Language","visitor_id#","visitor_id*","locationConsent","_bcvm_vid*","_bcvm_vid_#","_bcvm_vrid_#","_bcvm_vrid*","bc_pv_end","bc-visit-id","bc-visitor-id","_bc-curl","_url-cid","_bc_aa*"],"optionalCookies":{"analytics":"accepted"},"statement":{"shown":true,"updated":"06/06/2018"},"consentDate":1649030243872,"consentExpiry":90,"interactedWith":true,"user":"1BC6267C-8B79-41A4-BF99-4026452254C5"}; bc_pv_end=</string>
                </array>
                <key>re_pattern</key>
                <string>href="(?P&lt;url&gt;/siteassets.*kensingtonworks_(?P&lt;version&gt;[\d.]+)_[\d]+\.pkg)"</string>
                <key>request_headers</key>
                <dict>
                    <key>user-agent</key>
                    <string>%USER_AGENT%</string>
                </dict>
                <key>url</key>
                <string>https://www.kensington.com/software/kensingtonworks</string>
            </dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>%NAME%.pkg</string>
                <key>url</key>
                <string>https://www.kensington.com%url%</string>
            </dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%</string>
                <key>expected_authority_names</key>
                <array>
                    <string>Developer ID Installer: Kensington Computer Products Group (293UQF7R4S)</string>
                    <string>Developer ID Certification Authority</string>
                    <string>Apple Root CA</string>
                </array>
            </dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>flat_pkg_path</key>
                <string>%pathname%</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/unpack</string>
            </dict>
            <key>Processor</key>
            <string>FlatPkgUnpacker</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                <key>pkg_payload_path</key>
                <string>%RECIPE_CACHE_DIR%/unpack/kensingtonworks.pkg/Payload</string>
            </dict>
            <key>Processor</key>
            <string>PkgPayloadUnpacker</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>expected_authority_names</key>
                <array/>
                <key>input_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%/Applications/KensingtonWorks .app</string>
                <key>requirement</key>
                <string>identifier "com.kensington.kensingtonworks2.app" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "293UQF7R4S"</string>
                <key>strict_verification</key>
                <true/>
            </dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>expected_authority_names</key>
                <array/>
                <key>input_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%/Library/Application Support/Kensington/KensingtonWorks2/KensingtonWorksHelper.app</string>
                <key>requirement</key>
                <string>identifier "com.kensington.kensingtonworks2.helper2" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "293UQF7R4S"</string>
                <key>strict_verification</key>
                <true/>
            </dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>info_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%/Applications/KensingtonWorks .app/Contents/Info.plist</string>
                <key>plist_keys</key>
                <dict>
                    <key>CFBundleShortVersionString</key>
                    <string>version</string>
                    <key>LSMinimumSystemVersion</key>
                    <string>min_os_version</string>
                </dict>
            </dict>
            <key>Processor</key>
            <string>PlistReader</string>
        </dict>
    </array>
</dict>
</plist>
