<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Identifier</key>
    <string>com.github.apizz.munki.KensingtonTrackballWorks</string>
    <key>Input</key>
    <dict>
	<key>MUNKI_CATEGORY</key>
	<string>Drivers</string>
	<key>MUNKI_REPO_SUBDIR</key>
	<string>drivers</string>
	<key>NAME</key>
	<string>KensingtonTrackballWorks</string>
	<key>pkginfo</key>
	<dict>
	    <key>catalogs</key>
	    <array>
		<string>testing</string>
	    </array>
	    <key>category</key>
	    <string>%MUNKI_CATEGORY%</string>
	    <key>description</key>
	    <string>TrackballWorks™ allows you to program your Trackball to behave how you want it to by customizing the functions assigned to each Trackball button.</string>
	    <key>developer</key>
	    <string>Kensington Computer Products Group</string>
	    <key>display_name</key>
	    <string>Kensington TrackballWorks</string>
	    <key>name</key>
	    <string>%NAME%</string>
	    <key>unattended_install</key>
	    <true/>
	</dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.5.0</string>
    <key>ParentRecipe</key>
    <string>com.github.apizz.pkg.KensingtonTrackballWorks</string>
    <key>Process</key>
    <array>
        <dict>
    	    <key>Arguments</key>
    	    <dict>
		<key>pkginfo</key>
    	    	<dict>
    		    <key>version</key>
    		    <string>%version%</key>
    	    	</dict>
    	    </dict>
    	    <key>Processor</key>
    	    <string>MunkiPkginfoMerger</string>
    	</dict>
	<dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
