<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of Gradekeeper and makes a pkg.</string>
    <key>Identifier</key>
    <string>com.github.apizz.munki.Gradekeeper</string>
    <key>Input</key>
    <dict>
	<key>MUNKI_CATEGORY</key>
	<string>Software</string>
	<key>MUNKI_REPO_SUBDIR</key>
	<string>apps</string>
	<key>pkginfo</key>
	<dict>
	    <key>catalogs</key>
	    <array>
		<string>testing</string>
	    </array>
	    <key>category</key>
	    <string>%MUNKI_CATEGORY%</string>
	    <key>developer</key>
	    <string>Daniel Ethier</string>
	    <key>description</key>
	    <string>Gradekeeper makes dealing with grades easy!  Enter assignments and scores and let Gradekeeper do the rest. Gradekeeper computes grades, does seating charts, prints reports, and sends email progress reports. Gradekeeper makes it easy to keep parents and students up to date.</string>
	    <key>display_name</key>
	    <string>%NAME%</string>
	    <key>name</key>
	    <string>%NAME%</string>
	    <key>unattended_install</key>
	    <true/>
	</dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.4.0</string>
    <key>ParentRecipe</key>
    <string>com.github.apizz.pkg.Gradekeeper</string>
    <key>Process</key>
    <array>
	<dict>
	    <key>Arguments</key>
	    <dict>
		<key>pkg_path</key>
		<string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
		<key>repo_subdirectory</key>
		<string>%MUNKI_REPO_SUBDIR%</string>
	    </dict>
	    <key>Processor</key>
	    <string>MunkiImporter</string>
	</dict>
    </array>
</dict>
</plist>
