<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of Gradekeeper and makes a pkg.</string>
    <key>Identifier</key>
    <string>com.github.apizz.pkg.Gradekeeper</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Gradekeeper</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.4.0</string>
    <key>ParentRecipe</key>
    <string>com.github.apizz.download.Gradekeeper</string>
    <key>Process</key>
    <array>
	<dict>
	    <key>Arguments</key>
	    <dict>
		<key>pkgdirs</key>
		<dict>
		    <key>Applications</key>
		    <string>0775</string>
		    <key>Applications/Gradekeeper Folder</key>
		    <string>0755</string>
		</dict>
		<key>pkgroot</key>
		<string>%RECIPE_CACHE_DIR%/%NAME%</string>
	    </dict>
	    <key>Processor</key>
	    <string>PkgRootCreator</string>
	</dict>
	<dict>
	    <key>Arguments</key>
	    <dict>
		<key>source_path</key>
		<string>%pathname%/Install Gradekeeper.app/Contents/Resources/Installer Items/Gradekeeper Folder</string>
		<key>destination_path</key>
		<string>%RECIPE_CACHE_DIR%/%NAME%/Applications/Gradekeeper Folder</string>
		<key>overwrite</key>
		<true/>
		<key>purge_destination</key>
		<true/>
	    </dict>
	    <key>Processor</key>
	    <string>Copier</string>
	</dict>
	<dict>
	    <key>Arguments</key>
	    <dict>
		<key>input_plist_path</key>
		<string>%RECIPE_CACHE_DIR%/%NAME%/Applications/Gradekeeper Folder/Gradekeeper.app/Contents/Info.plist</string>
	    </dict>
	    <key>Processor</key>
	    <string>Versioner</string>
	</dict>
	<dict>
	    <key>Arguments</key>
	    <dict>
		<key>pkg_request</key>
		<dict>
		    <key>chown</key>
		    <array>
			<dict>
			    <key>group</key>
			    <string>admin</string>
			    <key>mode</key>
			    <string>0755</string>
			    <key>path</key>
			    <string>Applications</string>
			    <key>user</key>
			    <string>root</string>
			</dict>
		    </array>
		    <key>id</key>
		    <string>com.daniel-ethier.%NAME%</string>
		    <key>options</key>
		    <string>purge_ds_store</string>
		    <key>pkgname</key>
		    <string>%NAME%-%version%</string>
		    <key>version</key>
		    <string>%version%</string>
		</dict>
	    </dict>
	    <key>Processor</key>
	    <string>PkgCreator</string>
	</dict>
    </array>
</dict>
</plist>
