<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of FL Studio and imports it into a munki_repo. Set DERIVE_MIN_OS to a non-empty string to derive the minimum os version from MunkiInstallsItemsCreator, either via Input in an override or via the -k option, i.e.: `-k DERIVE_MIN_OS=yes`</string>
    <key>Identifier</key>
    <string>com.github.apizz.munki.FLStudio</string>
    <key>Input</key>
    <dict>
        <key>DERIVE_MIN_OS</key>
        <string></string>
        <key>MUNKI_CATEGORY</key>
        <string>Music</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/flstudio</string>
        <key>NAME</key>
        <string>FLStudio</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>category</key>
            <string>%MUNKI_CATEGORY%</string>
            <key>developer</key>
            <string>Image Line Software</string>
            <key>description</key>
            <string>FL Studio is a complete software music production environment or Digital Audio Workstation (DAW). Representing more than 20 years of innovative development it has everything you need in one package to compose, arrange, record, edit, mix and master professional quality music.</string>
            <key>display_name</key>
            <string>FL Studio</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>uninstall_method</key>
            <string>uninstall_script</string>
            <key>uninstall_script</key>
            <string>#!/bin/bash

# Vendor Documentation https://www.image-line.com/fl-studio-learning/fl-studio-online-manual/html/app_flstudioinstallationfiles.htm

/bin/echo Stopping launchd service...
/bin/launchctl bootout system/com.image-line.flc-install-helper-socket

/bin/echo Renmoving launchd service....
/bin/rm -Rf /Library/LaunchDaemons/com.image-line.flc-install-helper-socket.plist

/bin/echo Removing FL Studio 2024 and FL Cloud Plugins Applications...
/bin/rm -Rf "/Applications/FL Studio 2024.app"
/bin/rm -Rf "/Applications/FL Cloud Plugins.app"

# Vendor Documentation: https://support.image-line.com/action/knowledgebase?ans=87

/bin/echo Removing Licensing...
/bin/rm -Rf "/Library/Application Support/Image-Line"

exit</string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.6.1</string>
    <key>ParentRecipe</key>
    <string>com.github.apizz.pkg.FLStudio</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>derive_minimum_os_version</key>
                <string>%DERIVE_MIN_OS%</string>
                <key>faux_root</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                <key>installs_item_paths</key>
                <array>
                    <string>/Applications/FL Studio 2024.app</string>
                </array>
            </dict>
            <key>Processor</key>
            <string>MunkiInstallsItemsCreator</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict/>
            <key>Processor</key>
            <string>MunkiPkginfoMerger</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>re_pattern</key>
                <string>macos ([0-9]*\.[0-9]+) \([A-Za-z]+\) or higher</string>
                <key>result_output_var_name</key>
                <string>min_os_ver</string>
                <key>url</key>
                <string>https://www.image-line.com/fl-studio-download/</string>
            </dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>additional_pkginfo</key>
                <dict>
                    <key>version</key>
                    <string>%version%</string>
                    <key>minimum_os_version</key>
                    <string>%min_os_ver%</string>
                </dict>
            </dict>
            <key>Processor</key>
            <string>MunkiPkginfoMerger</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pkg_path%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
        <dict>
             <key>Arguments</key>
             <dict>
                 <key>mode</key>
                 <string>777</string>
                 <key>resource_path</key>
                 <string>%RECIPE_CACHE_DIR%/%NAME%</string>
             </dict>
             <key>Processor</key>
             <string>com.github.grahampugh.recipes.commonprocessors/ChangeModeOwner</string>
         </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>path_list</key>
                <array>
                    <string>%RECIPE_CACHE_DIR%/unpack</string>
                    <string>%RECIPE_CACHE_DIR%/%NAME%/Applications/FL Studio 2024.app</string>
                    <string>%RECIPE_CACHE_DIR%/%NAME%/Applications</string>
                    <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                </array>
            </dict>
            <key>Processor</key>
            <string>PathDeleter</string>
        </dict>
    </array>
</dict>
</plist>
