<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of Sqwarq FastTasks 2 and creates a pkg.</string>
    <key>Identifier</key>
    <string>com.github.apizz.pkg.FastTasks2</string>
    <key>Input</key>
    <dict>
	<key>NAME</key>
	<string>FastTasks2</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.0</string>
    <key>ParentRecipe</key>
    <string>com.github.apizz.download.FastTasks2</string>
    <key>Process</key>
    <array>
	<dict>
	    <key>Arguments</key>
	    <dict>
		<key>pkgdirs</key>
		<dict>
		    <key>Applications</key>
		    <string>0775</string>
		</dict>
		<key>pkgroot</key>
		<string>%RECIPE_CACHE_DIR%/pkgroot</string>
	    </dict>
	    <key>Processor</key>
	    <string>PkgRootCreator</string>
	</dict>
	<dict>
	    <key>Arguments</key>
	    <dict>
		<key>archive_path</key>
		<string>%pathname%</string>
		<key>destination_path</key>
		<string>%RECIPE_CACHE_DIR%/pkgroot/Applications</string>
		<key>purge_destination</key>
		<true/>
	    </dict>
	    <key>Processor</key>
	    <string>Unarchiver</string>
	</dict>
	<dict>
	    <key>Arguments</key>
	    <dict>
		<key>pkg_request</key>
		<dict>
		    <key>chown</key>
		    <array>
			<dict>
			    <key>group</key>
			    <string>admin</string>
			    <key>path</key>
			    <string>Applications</string>
			    <key>user</key>
			    <string>root</string>
			</dict>
		    </array>
		    <key>id</key>
		    <string>com.sqwarq.FastTasks-2</string>
		    <key>options</key>
		    <string>purge_ds_store</string>
		    <key>pkgname</key>
		    <string>%NAME%-%version%</string>
		    <key>version</key>
		    <string>%version%</string>
		</dict>
	    </dict>
	    <key>Processor</key>
	    <string>PkgCreator</string>
	</dict>
    </array>
</dict>
</plist>
