<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of Nicepage and imports it into a munki_repo.</string>
    <key>Identifier</key>
    <string>com.github.apizz.munki.Nicepage</string>
    <key>Input</key>
    <dict>
        <key>MUNKI_CATEGORY</key>
        <string>Developer Tools</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/nicepage</string>
        <key>NAME</key>
        <string>Nicepage</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>category</key>
            <string>%MUNKI_CATEGORY%</string>
            <key>description</key>
            <string>Create stunning websites and themes. Website Builder Software. Mobile-friendly. No Coding Wordpress, Joomla, HTML5, Windows, Mac OS and Online</string>
            <key>developer</key>
            <string>Artisteer, Ltd</string>
            <key>display_name</key>
            <string>Nicepage</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>ParentRecipe</key>
    <string>com.github.apizz.download.Nicepage</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
