<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of Google Drive File Stream.</string>
    <key>Identifier</key>
    <string>com.github.apizz.pkg.googledrivefilestream</string>
    <key>Input</key>
    <dict>
	<key>DOWNLOAD_URL</key>
	<string>https://dl.google.com/drive-file-stream/googledrivefilestream.dmg</string>
	<key>NAME</key>
	<string>GoogleDriveFileStream</string>
    </dict>
    <key>ParentRecipe</key>
    <string>com.github.apizz.download.googledrivefilestream</string>
    <key>Process</key>
    <array>
        <dict>
	    <key>Arguments</key>
	    <dict>
		<key>flat_pkg_path</key>
		<string>%pathname%/%NAME%.pkg</string>
		<key>destination_path</key>
		<string>%RECIPE_CACHE_DIR%/unpack</string>
	    </dict>
	    <key>Processor</key>
	    <string>FlatPkgUnpacker</string>
	</dict>
	<dict>
	    <key>Arguments</key>
	    <dict>
		<key>destination_path</key>
		<string>%RECIPE_CACHE_DIR%/unpack</string>
		<key>pkg_payload_path</key>
		<string>%RECIPE_CACHE_DIR%/unpack/GoogleDriveFileStream.pkg/Payload</string>
	    </dict>
	    <key>Processor</key>
	    <string>PkgPayloadUnpacker</string>
	</dict>
	<dict>
	    <key>Arguments</key>
	    <dict>
		<key>input_plist_path</key>
		<string>%RECIPE_CACHE_DIR%/unpack/Google Drive File Stream.app/Contents/Info.plist</string>
	    </dict>
	    <key>Processor</key>
	    <string>Versioner</string>
	</dict>
	<dict>
	    <key>Arguments</key>
	    <dict>
		<key>pkg_path</key>
		<string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
		<key>source_pkg</key>
		<string>%pathname%/%NAME%.pkg</string>
	    </dict>
	    <key>Processor</key>
	    <string>PkgCopier</string>
	</dict>
	<dict>
	    <key>Arguments</key>
	    <dict>
		<key>path_list</key>
		<array>
		    <string>%RECIPE_CACHE_DIR%/unpack</string>
		</array>
	    </dict>
	    <key>Processor</key>
	    <string>PathDeleter</string>
	</dict> 
    </array>
</dict>
</plist>
