<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of AlDente and imports it into a munki_repo.</string>
    <key>Identifier</key>
    <string>com.github.apizz.munki.AlDente</string>
    <key>Input</key>
    <dict>
        <key>MUNKI_CATEGORY</key>
        <string>System Utilities</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/aldente</string>
        <key>NAME</key>
        <string>AlDente</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>category</key>
            <string>%MUNKI_CATEGORY%</string>
            <key>description</key>
            <string>The ALL-IN-ONE Charge Limiter App For MacBooks. Use AlDente and extend the life of your MacBooks Battery. Use AlDente and extend the life of your MacBook's Battery.</string>
            <key>developer</key>
            <string>David Wernhart</string>
            <key>display_name</key>
            <string>AlDente</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.0</string>
    <key>ParentRecipe</key>
    <string>com.github.apizz.download.AlDente</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
