<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Imports a DMG with an Autodesk Maya installer app inside. Install requires copying the install app to a desired location on the endpoint and using a postinstall script to trigger the install.

To use this recipe:

1) Download a copy of Autodesk Maya 2020.
2) Create a recipe override of this recipe.
3) Specify a PATH where the recipe will look for a Maya 2020 DMG.
4) Specify a DESTINATION_PATH which munki will copy the install app to on endpoints. This will also be inserted in the postinstall script for installation.
5) Enter your Maya's KEY and SERIAL to be used in the postinstall script to active the software.
6) Run the recipe.
7) Profit.</string>
    <key>Identifier</key>
    <string>com.github.apizz.munki.AutdoeskMayaImport</string>
    <key>Input</key>
    <dict>
        <key>DESTINATION_PATH</key>
        <string>/private/tmp</string>
        <key>MUNKI_CATEGORY</key>
        <string>Video</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/maya</string>
        <key>NAME</key>
        <string>Maya2020</string>
        <key>PATH</key>
        <string>/Users/ap.orlebeke/Downloads</string>
        <key>MAYA_DEPLOYMENT_FILE</key>
        <string>%DESTINATION_PATH%/deployment_maya.xml</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>category</key>
            <string>%MUNKI_CATEGORY%</string>
            <key>description</key>
            <string>3D computer animation, modeling, simulation, and rendering software.</string>
            <key>developer</key>
            <string>Autodesk</string>
            <key>display_name</key>
            <string>Autodesk Maya 2020</string>
            <key>items_to_copy</key>
            <array>
                <dict>
                    <key>destination_path</key>
                    <string>%DESTINATION_PATH%</string>
                    <key>source_item</key>
                    <string>Install Maya 2020.app</string>
                </dict>
            </array>
            <key>name</key>
            <string>%NAME%</string>
            <key>postinstall_script</key>
            <string>#!/bin/bash

# Install path variables
INSTALLERPATH="/private/tmp/Install Maya 2020.app"
DEPLOY_FILE="/private/tmp/deployment_maya.xml"
SETUP="${INSTALLERPATH}/Contents/Helper/Setup.app/Contents/MacOS/Setup"
LGSDIR="/Library/Application Support/Autodesk/CLM/LGS/${KEY}_${VERSION}"
LGSFILE="${LGSDIR}/LGS.data"
KEY="657L1"

# Exit &amp; error if installer doesn't exist
if [ ! -d "$INSTALLERPATH" ]; then
    /bin/echo "${INSTALLERPATH} does not exist. Exiting ..."
    exit 1
fi

# Exit &amp; error if deploy file doesn't exist
if [ ! -f "$DEPLOY_FILE" ]; then
    /bin/echo "${DEPLOY_FILE} does not exist. Exiting ..."
    exit 1
fi

# Run Maya 2020 installer
"$SETUP" --silent --deployment "$DEPLOY_FILE"

# Make LGSDIR
/bin/mkdir -p "$LGSDIR"

# Write LGS.data file
/bin/echo "_STANDALONE" >> "$LGSFILE"

</string>
            <key>uninstall_method</key>
            <string>uninstall_script</string>
            <key>uninstall_script</key>
            <string>#!/bin/bash

# Per https://knowledge.autodesk.com/support/maya/troubleshooting/caas/sfdcarticles/sfdcarticles/How-to-uninstall-Maya-2020-on-macOS.html?v=2020%26st=install%20macos

MAYA="/Applications/Autodesk"
APPSUPPORT="/Library/Application Support/Autodesk"
PKGRECEIPTS=$(/usr/sbin/pkgutil --pkgs | /usr/bin/grep autodesk)
ROKOKO="/Applications/Rokoko Motion Library"
SUBSTANCE="/Applications/Substance in Maya"

# Remove Maya
if [ -d "$MAYA" ]; then
    /bin/rm -rf "$MAYA"
fi

# Remove App Support
if [ -d "$APPSUPPORT" ]; then
    /bin/rm -rf "$APPSUPPORT"
fi

# Remove Rokoko Library
if [ -d "$ROKOKO" ]; then
    /bin/rm -rf "$ROKOKO"
fi

# Remove Substance
if [ -d "$SUBSTANCE" ]; then
    /bin/rm -rf "$SUBSTANCE"
fi

# Unload LaunchDaemons
/bin/launchctl unload /Library/LaunchDaemons/com.autodesk*

# Remove LaunchDaemons
/bin/rm -rf /Library/LaunchDaemons/com.autodesk*

# Forget PKGs
for i in $PKGRECEIPTS; do
    /usr/sbin/pkgutil --forget $i
done</string>
            <key>unattended_install</key>
            <true/>
            <key>unattended_uninstall</key>
            <true/>
        </dict>
    </dict>
    <key>Process</key>
    <array>
        <dict>
            <key>Comment</key>
            <string>Gets the Autodesk Maya DMG filename located in the PATH</string>
            <key>Arguments</key>
            <dict>
                <key>pattern</key>
                <string>%PATH%/*Maya*2020*.dmg</string>
            </dict>
            <key>Processor</key>
            <string>FileFinder</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%found_filename%/Install Maya 2020.app</string>
                <key>requirement</key>
                <string>identifier "com.autodesk.desktop.delivery" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = XXKJ396S2Y</string>
                <key>strict_verification</key>
                <true/>
            </dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>flat_pkg_path</key>
                <string>%found_filename%/Install Maya 2020.app/Contents/Helper/Packages/Maya/Maya_core2020.pkg</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/unpack</string>
            </dict>
            <key>Processor</key>
            <string>FlatPkgUnpacker</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%/Applications/Autodesk/maya2020</string>
                <key>pkg_payload_path</key>
                <string>%RECIPE_CACHE_DIR%/unpack/Payload</string>
            </dict>
            <key>Processor</key>
            <string>PkgPayloadUnpacker</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>expected_authority_names</key>
                <array/>
                <key>input_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%/Applications/Autodesk/maya2020/Maya.app</string>
                <key>requirement</key>
                <string>identifier "com.autodesk.Maya.2020" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = XXKJ396S2Y</string>
                <key>strict_verification</key>
                <true/>
            </dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>package_info_path</key>
                <string>%RECIPE_CACHE_DIR%/unpack/PackageInfo</string>
            </dict>
            <key>Processor</key>
            <string>com.facebook.autopkg.shared/PackageInfoVersioner</string>
        </dict>
        <dict>
            <key>Comment</key>
            <string>Create a receipt based on the Maya core PKG, since this is the only place the major and minor versions are listed. Also write blank installs array to avoid undesirably having the installer app serve as an indicator of the item being installed.</string>
            <key>Arguments</key>
            <dict>
                <key>additional_pkginfo</key>
                <dict>
                    <key>installs</key>
                    <array/>
                    <key>receipts</key>
                    <array>
                        <dict>
                            <key>packageid</key>
                            <string>%pkg_id%</string>
                            <key>version</key>
                            <string>%version%</string>
                        </dict>
                    </array>
                    <key>version</key>
                    <string>%version%</string>
                </dict>
            </dict>
            <key>Processor</key>
            <string>MunkiPkginfoMerger</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%found_filename%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>path_list</key>
                <array>
                    <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                    <string>%RECIPE_CACHE_DIR%/unpack</string>
                </array>
            </dict>
            <key>Processor</key>
            <string>PathDeleter</string>
        </dict>

    </array>
</dict>
</plist>
