<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of SMART Utility.</string>
    <key>Identifier</key>
    <string>com.github.apizz.download.smartutility</string>
    <key>Input</key>
    <dict>
	<key>DOWNLOAD_PATTERN</key>
	<string>enclosure url="(?P&lt;url&gt;https\:\/\/cloudfront\.volitans-software\.com\/smartutility[\d]+\.zip)" sparkle:version=".*" sparkle:shortVersionString="(?P&lt;version&gt;[\d\.]+)"</string>
	<key>NAME</key>
	<string>SMARTUtility</string>
	<key>SPARKLE_URL</key>
	<string>https://www.volitans-software.com/stats/smart-utility/profileInfo.php</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.0</string>
    <key>Process</key>
    <array>
        <dict>
   	    <key>Arguments</key>
	    <dict>
		<key>re_pattern</key>
		<string>%DOWNLOAD_PATTERN%</string>
		<key>url</key>
		<string>%SPARKLE_URL%</string>
	    </dict>
	    <key>Processor</key>
	    <string>URLTextSearcher</string>
	</dict>
	<dict>
	    <key>Arguments</key>
	    <dict>
		<key>filename</key>
		<string>%NAME%-%version%.zip</string>
		<key>url</key>
		<string>%url%</string>
	    </dict>
	    <key>Processor</key>
	    <string>URLDownloader</string>
	</dict>
	<dict>
	    <key>Processor</key>
	    <string>EndOfCheckPhase</string>
	</dict>
    </array>
</dict>
</plist>
