<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of Shure Wireless Workbench.</string>
    <key>Identifier</key>
    <string>com.github.apizz.download.ShureWirelessWorkbench6</string>
    <key>Input</key>
    <dict>
        <key>SEARCH_PATTERN</key>
        <string>&lt;a href="https?:\/\/www.shure.com(?P&lt;url&gt;[a-zA-Z\-\.\/]+)"&gt;Wireless Workbench (?P&lt;version&gt;[0-9\.]+) \(macOS\)&lt;/a&gt;</string>
        <key>SEARCH_PAGE</key>
        <string>https://www.shure.com/americas/products/software/wireless-workbench/wireless-workbench-6#downloads</string>
        <key>NAME</key>
        <string>ShureWirelessWorkbench6</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>re_pattern</key>
                <string>%SEARCH_PATTERN%</string>
                <key>url</key>
                <string>%SEARCH_PAGE%</string>
            </dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>%NAME%.zip</string>
                <key>url</key>
                <string>https://www.shure.com%url%</string>
            </dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/downloads</string>
            </dict>
            <key>Processor</key>
            <string>Unarchiver</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%RECIPE_CACHE_DIR%/downloads/wireless-workbench-mac-v%version%.pkg</string>
                <key>expected_authority_names</key>
                <array>
                    <string>Developer ID Installer: Shure Incorporated (4K6323CXC4)</string>
                    <string>Developer ID Certification Authority</string>
                    <string>Apple Root CA</string>
                </array>
            </dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
        </dict>
    </array>
</dict>
</plist>
