<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Comment</key>
    <string>Created with Recipe Robot v1.0.5 (https://github.com/homebysix/recipe-robot)</string>
    <key>Description</key>
    <string>Downloads the latest version of iScream and imports it into Munki.</string>
    <key>Identifier</key>
    <string>com.github.apizz.munki.iScream</string>
    <key>Input</key>
    <dict>
	<key>MUNKI_CATEGORY</key>
	<string>Audio</string>
	<key>MUNKI_REPO_SUBDIR</key>
	<string>apps</string>
	<key>NAME</key>
	<string>iScream</string>
	<key>pkginfo</key>
	<dict>
	    <key>catalogs</key>
	    <array>
		<string>testing</string>
	    </array>
	    <key>category</key>
	    <string>%MUNKI_CATEGORY%</string>
	    <key>description</key>
	    <string>iScream is a freeware voice recording application for Mac OS X. It is designed to record audio from a microphone, line-in or any other input audio device.</string>
	    <key>developer</key>
	    <string>MediaHuman</string>
	    <key>display_name</key>
	    <string>iScream</string>
	    <key>name</key>
	    <string>%NAME%</string>
	    <key>unattended_install</key>
	    <true/>
	</dict>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.0</string>
    <key>ParentRecipe</key>
    <string>com.github.apizz.download.iScream</string>
    <key>Process</key>
    <array>
	<dict>
	    <key>Arguments</key>
	    <dict>
		<key>input_plist_path</key>
		<string>%pathname%/iScream.app/Contents/Info.plist</string>
		<key>plist_version_key</key>
		<string>CFBundleVersion</string>
	    </dict>
	    <key>Processor</key>
	    <string>Versioner</string>
	</dict>
	<dict>
	    <key>Arguments</key>
	    <dict>
		<key>additional_pkginfo</key>
		<dict>
		    <key>version</key>
		    <string>%version%</string>
		</dict>
	    </dict>
	    <key>Processor</key>
	    <string>MunkiPkginfoMerger</string>
	</dict>
	<dict>
	    <key>Arguments</key>
	    <dict>
		<key>pkg_path</key>
		<string>%pathname%</string>
		<key>repo_subdirectory</key>
		<string>%MUNKI_REPO_SUBDIR%</string>
		<key>version_comparison_key</key>
		<string>CFBundleVersion</string>
	    </dict>
	    <key>Processor</key>
	    <string>MunkiImporter</string>
	</dict>
    </array>
</dict>
</plist>
