<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Comment</key>
    <string>Created with Recipe Robot v1.0.5 (https://github.com/homebysix/recipe-robot)</string>
    <key>Description</key>
    <string>Downloads the latest version of iScream.</string>
    <key>Identifier</key>
    <string>com.github.apizz.download.iScream</string>
    <key>Input</key>
    <dict>
        <key>DOWNLOAD_URL</key>
        <string>https://www.mediahuman.com/download/iScream.dmg</string>
        <key>NAME</key>
        <string>iScream</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>%NAME%.dmg</string>
                <key>url</key>
                <string>%DOWNLOAD_URL%</string>
            </dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
