<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Replaces terminal-notifier app icns file with your own for custom branding and imports into Munki.</string>
    <key>Identifier</key>
    <string>com.github.apizz.munki.terminal-notifier-branded</string>
    <key>Input</key>
    <dict>
        <key>BRANDING_ICNS_PATH</key>
        <string>/path/to/local/ICNSICON.icns</string>
        <key>MUNKI_CATEGORY</key>
        <string>Github Tools</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>github-tools</string>
        <key>NAME</key>
        <string>terminal-notifier</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>category</key>
            <string>%MUNKI_CATEGORY%</string>
            <key>description</key>
            <string>Send User Notifications on Mac OS X 10.8 from the command-line.</string>
            <key>developer</key>
            <string>Julien Blanchard</string>
            <key>display_name</key>
            <string>terminal-notifier</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.6.1</string>
    <key>ParentRecipe</key>
    <string>com.github.morgrowe.download.terminal-notifier</string>
    <key>Process</key>
    <array>
    <dict>
        <key>Arguments</key>
        <dict>
            <key>archive_path</key>
            <string>%pathname%</string>
            <key>destination_path</key>
            <string>%RECIPE_CACHE_DIR%/%NAME%</string>
            <key>purge_destination</key>
            <true/>
        </dict>
        <key>Processor</key>
        <string>Unarchiver</string>
    </dict>
    <dict>
        <key>Arguments</key>
        <dict>
            <key>destination_path</key>
            <string>%RECIPE_CACHE_DIR%/%NAME%/terminal-notifier.app/Contents/Resources/Terminal.icns</string>
            <key>source_path</key>
            <string>%BRANDING_ICNS_PATH%</string>
            <key>overwrite</key>
            <true/>
        </dict>
        <key>Processor</key>
        <string>Copier</string>
    </dict>
    <dict>
        <key>Arguments</key>
        <dict>
            <key>dmg_path</key>
            <string>%RECIPE_CACHE_DIR%/%NAME%-%version%.dmg</string>
            <key>dmg_root</key>
            <string>%RECIPE_CACHE_DIR%/%NAME%/terminal-notifier.app</string>
        </dict>
        <key>Processor</key>
        <string>DmgCreator</string>
    </dict>
    <dict>
        <key>Arguments</key>
        <dict>
            <key>pkg_path</key>
            <string>%dmg_path%</string>
            <key>repo_subdirectory</key>
            <string>%MUNKI_REPO_SUBDIR%</string>
        </dict>
        <key>Processor</key>
        <string>MunkiImporter</string>
    </dict>
    </array>
</dict>
</plist>
