<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest release copy of the smartmontools from Github. Set PRERELEASE to a non-empty string to download prereleases, either via Input in an override or via the -k option, i.e.: `-k PRERELEASE=yes`</string>
    <key>Identifier</key>
    <string>com.github.apizz.download.smartmontools</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>smartmontools</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.6.1</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>asset_regex</key>
                <string>smartmontools-.*dmg$</string>
                <key>github_repo</key>
                <string>smartmontools/smartmontools</string>
                <key>include_prereleases</key>
                <string>%PRERELEASE%</string>
            </dict>
            <key>Processor</key>
            <string>GitHubReleasesInfoProvider</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>%NAME%.dmg</string>
           </dict>
           <key>Processor</key>
           <string>URLDownloader</string>
       </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pattern</key>
                <string>%pathname%/smartmontools*.pkg</string>
            </dict>
            <key>Processor</key>
            <string>FileFinder</string>
        </dict>
        <dict>
            <key>Comment</key>
            <string>Because the smartmontools Github doesn't have a clean release version number, we have to get this ourselves from the PKG</string>
            <key>Arguments</key>
            <dict>
                <key>flat_pkg_path</key>
                <string>%pathname%/%dmg_found_filename%</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/unpack</string>
            </dict>
            <key>Processor</key>
            <string>FlatPkgUnpacker</string>
        </dict>
        <dict>
            <key>Comment</key>
            <string>Collect the version number from the extracted flat PKG</string>
            <key>Arguments</key>
            <dict>
                <key>package_info_path</key>
                <string>%RECIPE_CACHE_DIR%/unpack/PackageInfo</string>
            </dict>
            <key>Processor</key>
            <string>com.facebook.autopkg.shared/PackageInfoVersioner</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>path_list</key>
                <array>
                    <string>%RECIPE_CACHE_DIR%/unpack</string>
                </array>
            </dict>
            <key>Processor</key>
            <string>PathDeleter</string>
        </dict>
    </array>
</dict>
</plist>
