<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest release copy of the defaultbrowser executable from kerma on Github and creates a package.</string>
    <key>Identifier</key>
    <string>com.github.apizz.pkg.defaultbrowser</string>
    <key>Input</key>
    <dict>
	<key>NAME</key>
	<string>defaultbrowser</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.4.0</string>
    <key>ParentRecipe</key>
    <string>com.github.apizz.download.defaultbrowser</string>
    <key>Process</key>
    <array>
	<dict>
	    <key>Arguments</key>
	    <dict>
		<key>pkgdirs</key>
		<dict>
		    <key>usr</key>
		    <string>0755</string>
		    <key>usr/local/</key>
		    <string>0755</string>
		    <key>usr/local/bin/</key>
		    <string>0775</string>
		</dict>
		<key>pkgroot</key>
		<string>%RECIPE_CACHE_DIR%/%NAME%</string>
	    </dict>
	    <key>Processor</key>
	    <string>PkgRootCreator</string>
	</dict>
	<dict>
	    <key>Arguments</key>
	    <dict>
		<key>destination_path</key>
		<string>%pkgroot%/usr/local/bin/</string>
		<key>source_path</key>
		<string>%pathname%</string>
	    </dict>
	    <key>Processor</key>
	    <string>Copier</string>
	</dict>
	<dict>
	    <key>Arguments</key>
	    <dict>
		<key>pkg_request</key>
		<dict>
		    <key>chown</key>
		    <array>
			<dict>
			    <key>group</key>
			    <string>wheel</string>
			    <key>mode</key>
			    <string>0755</string>
			    <key>path</key>
			    <string>usr</string>
			    <key>user</key>
			    <string>root</string>
			</dict>
		    </array>
		    <key>id</key>
		    <string>com.github.kerma.defaultbrowser</string>
		    <key>options</key>
		    <string>purge_ds_store</string>
		    <key>pkgname</key>
		    <string>%NAME%-%version%</string>
		    <key>version</key>
		    <string>%version%</string>
		</dict>
	    </dict>
	    <key>Processor</key>
	    <string>PkgCreator</string>
	</dict>
    </array>
</dict>
</plist>
