<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest release copy of the defaultbrowser executable from kerma on Github. Set PRERELEASE to a non-empty string to download prereleases, either via Input in an override or via the -k option, i.e.: `-k PRERELEASE=yes`</string>
    <key>Input</key>
    <dict>
	<key>NAME</key>
	<string>defaultbrowser</string>
	<key>PRERELEASE</key>
        <string></string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.6.1</string>
    <key>Process</key>
    <array>
        <dict>
	    <key>Arguments</key>
	    <dict>
	        <key>github_repo</key>
	        <string>kerma/defaultbrowser</string>
	        <key>include_preleases</key>
	        <string>%PRERELEASE%</string>
	    </dict>
	    <key>Processor</key>
	    <string>GitHubReleasesInfoProvider</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>%NAME%</string>
	    </dict>
	    <key>Processor</key>
	    <string>URLDownloader</string>
	</dict>
        <dict>
	    <key>Processor</key>
	    <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
