<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of Navicat for MongDB 16 and imports it into a munki_repo.</string>
    <key>Identifier</key>
    <string>com.github.apizz.munki.NavicatMongoDB16</string>
    <key>Input</key>
    <dict>
        <key>MUNKI_CATEGORY</key>
        <string>Developer Tools</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/navicat</string>
        <key>NAME</key>
        <string>NavicatMongoDB16</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>category</key>
            <string>%MUNKI_CATEGORY%</string>
            <key>developer</key>
            <string>PremiumSoft</string>
            <key>description</key>
            <string>Navicat for MongoDB gives you a highly effective GUI interface for MongoDB database management, administration and development. Connect to local/remote MongoDB servers with MongoDB Atlas compatibility. Navicat for MongoDB offers remarkable features for managing, monitoring, querying, and visualizing your data. You can easily increase productivity of routine MongoDB operations.</string>
            <key>display_name</key>
            <string>Navicat for MongoDB</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.3.1</string>
    <key>ParentRecipe</key>
    <string>com.github.apizz.download.NavicatMongoDB16</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>