<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of the Yamaha CL Editor.</string>
    <key>Identifier</key>
    <string>com.github.apizz.download.YamahaCLEditor</string>
    <key>Input</key>
    <dict>
    	<key>DOWNLOAD_URL</key>
    	<string>https://usa.yamaha.com</string>
        <key>NAME</key>
        <string>CLEditor</string>
        <key>SEARCH_PATTERN</key>
        <string>(?P&lt;url&gt;\/files\/download\/software\/[\d]+\/[\d]+\/cl_[\w\d]+_mac\.zip)</string>
        <key>SEARCH_URL</key>
        <string>https://usa.yamaha.com/support/updates/cl_edt_mac.html</string>
        <key>USER_AGENT</key>
        <string>Mozilla/5.0 (Macintosh; Intel Mac OS X 10_14_6) AppleWebKit/536.28.10 (KHTML, like Gecko) Version/6.0.3 Safari/536.28.10</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.0</string>
    <key>Process</key>
    <array>
    	<dict>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>%SEARCH_PATTERN%</string>
				<key>url</key>
				<string>%SEARCH_URL%</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>%NAME%.zip</string>
                <key>request_headers</key>
                <dict>
                    <key>user-agent</key>
                    <string>%USER_AGENT%</string>
                </dict>
                <key>url</key>
                <string>%DOWNLOAD_URL%%url%</string>
            </dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
        	<key>Arguments</key>
        	<dict>
        		<key>purge_destination</key>
        		<true/>
        	</dict>
        	<key>Processor</key>
        	<string>Unarchiver</string>
        </dict>
        <dict>
        	<key>Arguments</key>
        	<dict>
        		<key>pattern</key>
        		<string>%RECIPE_CACHE_DIR%/%NAME%/*/*.pkg</string>
        	</dict>
        	<key>Processor</key>
        	<string>FileFinder</string>
        </dict>
        <dict>
        	<key>Arguments</key>
        	<dict>
        		<key>source</key>
        		<string>%found_filename%</string>
        		<key>target</key>
        		<string>%RECIPE_CACHE_DIR%/%NAME%.pkg</string>
        	</dict>
        	<key>Processor</key>
        	<string>FileMover</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>expected_authority_names</key>
                <array>
                    <string>Developer ID Installer: Yamaha Corporation (5LE7A8CF65)</string>
                    <string>Developer ID Certification Authority</string>
                    <string>Apple Root CA</string>
                </array>
                <key>input_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%.pkg</string>
            </dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>flat_pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%.pkg</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/unpack</string>
            </dict>
            <key>Processor</key>
            <string>FlatPkgUnpacker</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                <key>pkg_payload_path</key>
                <string>%RECIPE_CACHE_DIR%/unpack/CLEditor.pkg/Payload</string>
            </dict>
            <key>Processor</key>
            <string>PkgPayloadUnpacker</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>expected_authority_names</key>
                <array/>
                <key>input_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%/Applications/CL Editor.app</string>
                <key>requirement</key>
                <string>identifier "com.yamaha.pa.cleditor" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "5LE7A8CF65"</string>
                <key>strict_verifications</key>
                <true/>
            </dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
        </dict>
    </array>
</dict>
</plist>
