<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Identifier</key>
    <string>com.github.apizz.munki.iPartition</string>
    <key>Input</key>
    <dict>
        <key>MUNKI_CATEGORY</key>
	<string>Utilities</string>
	<key>MUNKI_REPO_SUBDIR</key>
	<string>apps/ipartition</string>
	<key>NAME</key>
	<string>iPartition</string>
	<key>pkginfo</key>
	<dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
	    <key>category</key>
	    <string>%MUNKI_CATEGORY%</string>
	    <key>description</key>
	    <string>iPartition’s intelligent partitioning algorithm makes it easy to repartition your Mac OS X or PC disks — just select a partition and drag the slider to resize it, with no need to tediously shuffle partitions around yourself to get the disk the way you want.
      For Boot Camp users, iPartition natively supports HFS, HFS+, FAT and NTFS filesystems, which makes it a breeze to resize your Windows partition if you find that you made it the wrong size.</string>
	    <key>developer</key>
	    <string>Coriolis Systems Limited</string>
	    <key>display_name</key>
	    <string>iPartition</string>
	    <key>name</key>
	    <string>%NAME%</string>
	    <key>unattended_install</key>
	    <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.0</string>
    <key>ParentRecipe</key>
    <string>com.github.apizz.download.iPartition</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
