<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of iPartition.</string>
    <key>Identifier</key>
    <string>com.github.apizz.download.iPartition</string>
    <key>Input</key>
    <dict>
	<key>SEARCH_PATTERN</key>
	<string>Version (?&lt;version&gt;[\d.]+)</string>
	<key>SEARCH_PAGE</key>
	<string>https://coriolis-systems.com/iPartition</string>
	<key>NAME</key>
	<string>iPartition</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.0</string>
    <key>Process</key>
    <array>
	<dict>
	    <key>Arguments</key>
	    <dict>
		<key>re_pattern</key>
		<string>%SEARCH_PATTERN%</string>
		<key>url</key>
		<string>%SEARCH_PAGE%</string>
	    </dict>
	    <key>Processor</key>
	    <string>URLTextSearcher</string>
	</dict>
	<dict>
	    <key>Arguments</key>
	    <dict>
		<key>filename</key>
		<string>%NAME%-%version%.dmg</string>
		<key>url</key>
		<string>https://coriolis-systems.com/downloads/iPartition-%version%.dmg</string>
	    </dict>
	    <key>Processor</key>
	    <string>URLDownloader</string>
	</dict>
	<dict>
	    <key>Processor</key>
	    <string>EndOfCheckPhase</string>
	</dict>
	<dict>
	    <key>Arguments</key>
	    <dict>
		<key>input_path</key>
		<string>%pathname%/iPartition.app</string>
		<key>requirement</key>
		<string>anchor apple generic and identifier "com.coriolis-systems.iPartition" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "6R668G5U99")</string>
	    </dict>
	    <key>Processor</key>
	    <string>CodeSignatureVerifier</string>
	</dict>
    </array>
</dict>
</plist>
