
<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Identifier</key>
    <string>com.github.apizz.munki.DataBackupMac</string>
    <key>Input</key>
    <dict>
        <key>MUNKI_CATEGORY</key>
        <string>Utilities</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/databackupmac</string>
        <key>NAME</key>
        <string>DataBackupMac</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>category</key>
            <string>%MUNKI_CATEGORY%</string>
            <key>description</key>
            <string>Data Backup is a powerful utility that allows you to backup, restore and synchronize your valuable data with minimal effort. Whether you are a new computer user or a seasoned professional, Data Backup offers you just the right amount of power, flexibility and ease-of-use to help you protect your files fast.</string>
            <key>developer</key>
            <string>Prosoft Engineering, Inc.</string>
            <key>display_name</key>
            <string>Data Backup Mac</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.0</string>
    <key>ParentRecipe</key>
    <string>com.github.apizz.download.DataBackupMac</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
