<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Munki recipe for GarageBand to be used in conjunction with mas-cli (https://github.com/mas-cli/mas) and AppStoreExtractor.sh (https://github.com/maxschlapfer/MacAdminHelpers) in order to import signed MAS apps distributed via PKG into munki.</string> 
    <key>Identifier</key>
    <string>com.github.apizz.munki.GarageBand</string>
    <key>Input</key>
    <dict>
        <key>APP_PATH</key>
        <string>/Applications/%NAME%.app</string>
        <key>APP_EXTRACTOR_PATH</key>
        <string>/Users/Shared/AppStore_Packages</string>
        <key>MUNKI_CATEGORY</key>
        <string>Music</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/garageband</string>
        <key>NAME</key>
        <string>GarageBand</string>
        <key>pkginfo</key>
        <dict>
	    <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>category</key>
            <string>%MUNKI_CATEGORY%</string>
            <key>description</key>
            <string>Rebuilt from the ground up with a fresh new look and amazing new features, GarageBand is the easiest way to create a great-sounding song on your Mac. Add realistic, impeccably produced and performed drum grooves to your song with Drummer. Easily shape the sound of any instrument in the Sound Library with Smart Controls. Crank up the bottom end with Bass Amp Designer, or mix and match electric guitar amps, cabinets, and pedals with Amp Designer and Pedalboard. Control GarageBand and play any software instrument wirelessly on your iPad using the Logic Remote app. Use iCloud to keep your GarageBand projects updated across multiple Mac computers, or even import GarageBand for iOS songs directly from iCloud.</string>
            <key>developer</key>
            <string>Apple Inc.</string>
            <key>display_name</key>
            <string>GarageBand</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.0</string>
    <key>Process</key>
    <array>
    	<dict>
            <key>Arguments</key>
            <dict>
                <key>info_path</key>
                <string>%APP_PATH%</string>
                <key>plist_keys</key>
                <dict>
                    <key>CFBundleShortVersionString</key>
                    <string>version</string>
                    <key>LSMinimumSystemVersion</key>
                    <string>minimum_os_version</string>
                </dict>
            </dict>
            <key>Processor</key>
            <string>PlistReader</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%APP_EXTRACTOR_PATH%/%NAME%_%version%.dmg/%NAME%_%version%.pkg</string>
                <key>expected_authority_names</key>
                <array>
                    <string>Apple Mac OS Installer Package Signing</string>
                    <string>Apple Worldwide Developer Relations Certification Authority</string>
                    <string>Apple Root CA</string>
                </array>
            </dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>additional_pkginfo</key>
                <dict>
                    <key>version</key>
                    <string>%version%</string>
                    <key>minimum_os_version</key>
                    <string>%minimum_os_version%</string>
                </dict>
            </dict>
            <key>Processor</key>
            <string>MunkiPkginfoMerger</string>
        </dict>
        <dict>
	    <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%APP_EXTRACTOR_PATH%/%NAME%_%version%.dmg</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
