<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of Code42 and extracts the installer PKG.
    
Provide the desired architecture in the ARCH variable. Options include:
- "x86_64" (default, downloads the Intel-based version)
- "arm64" (downloads the arm64 version)
</string>
    <key>Identifier</key>
    <string>com.github.apizz.pkg.Code42</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Code42</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.1.0</string>
    <key>ParentRecipe</key>
    <string>com.github.apizz.download.Code42</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>source_pkg</key>
                <string>%pathname%/*.pkg</string>
                <key>pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
            </dict>
            <key>Processor</key>
            <string>PkgCopier</string>
        </dict>
    </array>
</dict>
</plist>
