<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Identifier</key>
    <string>com.github.apizz.munki.Auralia</string>
    <key>Input</key>
    <dict>
	<key>MUNKI_CATEGORY</key>
	<string>Music</string>
	<key>MUNKI_REPO_SUBDIR</key>
	<string>apps</string>
	<key>NAME</key>
	<string>Auralia</string>
	<key>pkginfo</key>
	<dict>
	    <key>catalogs</key>
	    <array>
		<string>testing</string>
	    </array>
	    <key>category</key>
	    <string>%MUNKI_CATEGORY%</string>
	    <key>description</key>
	    <string>Ear training with real music. With 43 topics and endless customisation Auralia is the most comprehensive ear training software available. All the fundamentals are covered; pitch, intervals, chords, scales, tuning and rhythm. Progress through cadences, rhythm dictation, harmony, jazz progressions and melodic transcription!</string>
	    <key>developer</key>
	    <string>Rising Software</string>
	    <key>display_name</key>
	    <string>Auralia</string>
	    <key>name</key>
	    <string>%NAME%</string>
	    <key>unattended_install</key>
	    <true/>
	</dict>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.0</string>
    <key>ParentRecipe</key>
    <string>com.github.apizz.download.Auralia</string>
    <key>Process</key>
    <array>
    	<dict>
    	    <key>Arguments</key>
            <dict>
            	<key>additional_pkginfo</key>
            	<dict>
            	    <key>version</key>
            	    <string>%version%</string>
            	</dict>
            </dict>
            <key>Processor</key>
            <string>MunkiPkginfoMerger</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
