<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Identifier</key>
    <string>com.github.apizz.munki.Auralia</string>
    <key>Input</key>
    <dict>
    <key>MUNKI_CATEGORY</key>
	<string>Music</string>
	<key>MUNKI_REPO_SUBDIR</key>
	<string>apps</string>
	<key>NAME</key>
	<string>Auralia</string>
	<key>pkginfo</key>
	<dict>
	    <key>catalogs</key>
	    <array>
		<string>testing</string>
	    </array>
	    <key>category</key>
	    <string>%MUNKI_CATEGORY%</string>
	    <key>description</key>
	    <string>Ear training with real music. With 43 topics and endless customisation Auralia is the most comprehensive ear training software available. All the fundamentals are covered; pitch, intervals, chords, scales, tuning and rhythm. Progress through cadences, rhythm dictation, harmony, jazz progressions and melodic transcription!</string>
	    <key>developer</key>
	    <string>Rising Software</string>
	    <key>display_name</key>
	    <string>Auralia %MAJOR_VERSION%</string>
	    <key>name</key>
	    <string>%NAME%%MAJOR_VERSION%</string>
	    <key>unattended_install</key>
	    <true/>
	</dict>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.0</string>
    <key>ParentRecipe</key>
    <string>com.github.apizz.download.Auralia</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>info_path</key>
                <string>%RECIPE_CACHE_DIR%/payload/Applications/Auralia %MAJOR_VERSION%.app/Contents/Info.plist</string>
                <key>plist_keys</key>
                <dict>
                    <key>LSMinimumSystemVersion</key>
                    <string>min_os_vers</string>
                </dict>
            </dict>
            <key>Processor</key>
            <string>PlistReader</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>faux_root</key>
                <string>%RECIPE_CACHE_DIR%/payload</string>
                <key>installs_item_paths</key>
                <array>
                    <string>/Applications/Auralia %MAJOR_VERSION%.app</string>
                </array>
            </dict>
            <key>Processor</key>
            <string>MunkiInstallsItemsCreator</string>
        </dict>
    	<dict>
    	    <key>Arguments</key>
            <dict>
            </dict>
            <key>Processor</key>
            <string>MunkiPkginfoMerger</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>path_list</key>
                <array>
                    <string>%RECIPE_CACHE_DIR%/unpack</string>
                    <string>%RECIPE_CACHE_DIR%/payload</string>
                </array>
            </dict>
            <key>Processor</key>
            <string>PathDeleter</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>additional_makepkginfo_options</key>
                <array>
                    <string>--pkgvers</string>
                    <string>%version%</string>
                    <string>--minimum_os_version</string>
                    <string>%min_os_vers%</string>
                </array>
                <key>force_munkiimport</key>
                <true/>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
