<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest Google Chat and imports it into a munki_repo.</string>
    <key>Identifier</key>
    <string>com.github.apizz.munki.hangoutschat</string>
    <key>Input</key>
    <dict>
        <key>MUNKI_CATEGORY</key>
        <string>Communication</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/googlechat</string>
        <key>NAME</key>
        <string>GoogleChat</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>category</key>
            <string>%MUNKI_CATEGORY%</string>
            <key>developer</key>
            <string>Google Inc.</string>
            <key>description</key>
            <string>Google Chat is an intelligent and secure communication tool, built for teams. From direct messages to team chat rooms, Google Chat provides and integrated platform that makes team communication easy and efficient. Current version is for G Suite customers only.</string>
            <key>display_name</key>
            <string>Google Chat</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.4.0</string>
    <key>ParentRecipe</key>
    <string>com.github.apizz.download.hangoutschat</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
