<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Identifier</key>
    <string>com.github.apizz.munki.RocketChatClientDMG</string>
    <key>Input</key>
    <dict>
        <key>MUNKI_CATEGORY</key>
	<string>Communication</string>
	<key>MUNKI_REPO_SUBDIR</key>
	<string>apps/rocketchat</string>
	<key>NAME</key>
	<string>RocketChatClient</string>
	<key>pkginfo</key>
	<dict>
	    <key>catalogs</key>
	    <array>
		<string>testing</string>
	    </array>
	    <key>category</key>
	    <string>%MUNKI_CATEGORY%</string>
	    <key>description</key>
	    <string>Desktop application for Rocket.Chat available for macOS, Windows and Linux using Electron.</string>
	    <key>developer</key>
	    <string>Rocket.Chat Technologies Corp.</string>
	    <key>display_name</key>
	    <string>Rocket Chat Client</string>
	    <key>name</key>
	    <string>%NAME%</string>
	    <key>unattended_install</key>
	    <true/>
	</dict>
    </dict>
    <key>ParentRecipe</key>
    <string>com.github.apizz.download.RocketChatClient</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
           	<key>pkg_path</key>
           	<string>%pathname%</string>
           	<key>repo_subdirectory</key>
           	<string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
