<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of the Epson Scanner Driver and Epson Scan Utility from Epson's site.  This recipe should be used with items that use Epson's newer signing certificate.  Use EpsonScannerDriverandScanUtility.download.recipe for older items.

Based on &amp; description taken from @jazzace's EpsonSureColorDrivers recipe: https://github.com/autopkg/jazzace-recipes/blob/master/Epson/EpsonSureColorDrivers.download.recipe

IMPORTANT:
This recipe requires that you find the support page for your product and copy that URL for 
use as the base string for the SEARCH_URL key in your override. In order for the recipe to 
work, the target OS must be explicitly specified in the URL.

Recommended Procedure for Creating URL:
1. Go to the Epson site for your country.
2. Find the support page for your Epson device.
3. The support page will attempt to determine your current OS version and will display that 
in a pop-up menu on the page. If that is OS you are targeting for deployment, temporarily 
change the value in that popup menu to any other OS, wait a second (enough for the page to 
quickly reload), and then change to the OS you are targeting for deployment. If you are 
targeting a different OS, then directly change the OS in the popup menu. 
4. Copy the URL.
5. Create an override of this recipe (or edit an existing override).
6. In the Input section, paste the URL that you copied earlier into the string for SEARCH_URL.
7. Check the URL you just pasted. Confirm that it ends with one of the following strings
(substituting the number of the OS as appropriate). You can append this string if it is not 
present. 

For macOS 10.12 and later:     ?review-filter=macOS+10.12.x
For OS X 10.11.x and earlier:  ?review-filter=Mac+OS+X+10.11.x

For example, the URL for the Epson Perfection V850 Pro fetched from the US Epson site with macOS Mojave as the deployment OS is:

    https://epson.com/Support/Scanners/Perfection-Series/Epson-Perfection-V850-Pro/s/SPT_B11B224201?review-filter=macOS+10.14.x</string>
    <key>Identifier</key>
    <string>com.github.apizz.download.EpsonScannerDriverandScanUtility-NewCert</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Epson_Scanner_Driver_and_Scan_Utility</string>
        <key>SEARCH_URL</key>
        <string>https://www.epson.com/Support/override/this</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.4.0</string>
    <key>Process</key>
    <array>
       <dict>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%SEARCH_URL%</string>
                <key>re_pattern</key>
                <string>"Scanner Driver[^v]*v[\d.]+[\s\w="-;]+href="(https://ftp.epson.com/drivers/[\w].*\.dmg)"</string>
                <key>result_output_var_name</key>
                <string>url</string>
            </dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/*.pkg</string>
                <key>expected_authority_names</key>
                <array>
                    <string>Developer ID Installer: Seiko Epson Corporation (TXAEAV5RN4)</string>
                    <string>Developer ID Certification Authority</string>
                    <string>Apple Root CA</string>
                </array>
            </dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
        </dict>
    </array>
</dict>
</plist>
