<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Munki recipe for Apple Configurator 2 to be used in conjunction with mas-cli (https://github.com/mas-cli/mas) and AppStoreExtractor.sh (https://github.com/maxschlapfer/MacAdminHelpers) in order to import signed MAS apps distributed via PKG into munki.</string> 
    <key>Identifier</key>
    <string>com.github.apizz.munki.AppleConfigurator2</string>
    <key>Input</key>
    <dict>
        <key>APP_PATH</key>
        <string>/Applications/%NAME%.app</string>
        <key>APP_EXTRACTOR_PATH</key>
        <string>/Users/Shared/AppStore_Packages</string>
        <key>MUNKI_CATEGORY</key>
        <string>Video</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/appleconfigurator</string>
        <key>NAME</key>
        <string>AppleConfigurator2</string>
        <key>pkginfo</key>
        <dict>
	    <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>category</key>
            <string>%MUNKI_CATEGORY%</string>
            <key>description</key>
            <string>Apple Configurator 2 makes it easy to deploy iPad, iPhone, iPod touch, and Apple TV devices in your school or business.

Use Apple Configurator 2 to quickly configure large numbers of devices connected to your Mac via USB with the settings, apps, and data you specify for your students, employees, or customers.

Rebuilt from the ground up, Apple Configurator 2 features a flexible, device-centric design that enables you to configure one or dozens of devices quickly and easily. Simply select a single device or many at once and perform an action. With Apple Configurator 2, you're able to update software, install apps and configuration profiles, rename and change wallpaper on devices, export device information and documents, and much more. You can also inspect any device to see details like serial number and hardware addresses, which apps and profiles are installed, and its console log.</string>
            <key>developer</key>
            <string>Apple Inc.</string>
            <key>display_name</key>
            <string>Apple Configurator 2</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.0</string>
    <key>Process</key>
    <array>
    	<dict>
            <key>Arguments</key>
            <dict>
                <key>info_path</key>
                <string>%APP_PATH%</string>
                <key>plist_keys</key>
                <dict>
                    <key>CFBundleShortVersionString</key>
                    <string>version</string>
                    <key>LSMinimumSystemVersion</key>
                    <string>minimum_os_version</string>
                </dict>
            </dict>
            <key>Processor</key>
            <string>PlistReader</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%APP_EXTRACTOR_PATH%/%NAME%_%version%.dmg/%NAME%_%version%.pkg</string>
                <key>expected_authority_names</key>
                <array>
                    <string>Apple Mac OS Installer Package Signing</string>
                    <string>Apple Worldwide Developer Relations Certification Authority</string>
                    <string>Apple Root CA</string>
                </array>
            </dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>additional_pkginfo</key>
                <dict>
                    <key>version</key>
                    <string>%version%</string>
                    <key>minimum_os_version</key>
                    <string>%minimum_os_version%</string>
                </dict>
            </dict>
            <key>Processor</key>
            <string>MunkiPkginfoMerger</string>
        </dict>
        <dict>
	    <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%APP_EXTRACTOR_PATH%/%NAME%_%version%.dmg</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
