<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Download the latest version of the Unity Documentation pkg and imports it into a munki_repo.

Need to supply the munki item name for Unity 3D in UNITY_MUNKI_ITEM_NAME to correctly link this support installer to it along with the correct version.

A preinstall script in this support package checks to make sure the same version of Unity 3D is installed, otherwise it fails.</string>
    <key>Identifier</key>
    <string>com.github.apizz.munki.Unity3DDocumentation</string>
    <key>Input</key>
    <dict>
        <key>MUNKI_CATEGORY</key>
        <string>Development</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps-content/unity</string>
        <key>NAME</key>
        <string>Unity3D_Documentation</string>
        <key>UNITY_MUNKI_ITEM_NAME</key>
        <string>munki_item_name_here</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>category</key>
            <string>%MUNKI_CATEGORY%</string>
            <key>developer</key>
            <string>Unity Technologies</string>
            <key>display_name</key>
            <string>Unity 3D - Documentation</string>
            <key>description</key>
            <string>Documentation component for Unity 3D.</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.9</string>
    <key>ParentRecipe</key>
    <string>com.github.apizz.pkg.Unity3DDocumentation</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>additional_pkginfo</key>
                <dict>
                    <key>update_for</key>
                    <array>
                        <string>%UNITY_MUNKI_ITEM_NAME%-%version%</string>
                    </array>
                </dict>
            </dict>
            <key>Processor</key>
            <string>MunkiPkginfoMerger</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pkg_path%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
