<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Download the latest version of the Unity macOS Support pkg and imports it into a munki_repo.

Need to supply the munki item name for Unity 3D in UNITY_MUNKI_ITEM_NAME to correctly link this support installer to it along with the correct version.

A preinstall script in this support package checks to make sure the same version of Unity 3D is installed, otherwise it fails.</string>
    <key>Identifier</key>
    <string>com.github.apizz.autopkg.munki.Unity3DmacOS</string>
    <key>Input</key>
    <dict>
        <key>MUNKI_CATEGORY</key>
        <string>Development</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps-content/unity</string>
        <key>NAME</key>
        <string>Unity3D_macOSSupport</string>
        <key>RECEIPT_PATH</key>
        <string>/Library/Receipts</string>
        <key>UNITY_MUNKI_ITEM_NAME</key>
        <string>munki_item_name_here</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>category</key>
            <string>%MUNKI_CATEGORY%</string>
            <key>developer</key>
            <string>Unity Technologies</string>
            <key>display_name</key>
            <string>Unity 3D - macOS Support</string>
            <key>description</key>
            <string>macOS Support component for Unity 3D.</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.9</string>
    <key>ParentRecipe</key>
    <string>com.github.apizz.autopkg.download.Unity3DmacOS</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>additional_pkginfo</key>
                <dict>
                    <key>installcheck_script</key>
                    <string>#!/bin/bash
# Check for existing receipt and version
RECEIPT="%RECEIPT_PATH%/Unity3D_macos_version.txt"
INSTALLED_VERSION=$(cat "$RECEIPT")
VERSION="%version%"

if [ ! -f "$RECEIPT" ] || [ "$INSTALLED_VERSION" != "$VERSION" ] &amp;&amp; [[ "$INSTALLED_VERSION" &lt; "$VERSION" ]]; then
    exit 0
else
    exit 1
fi</string>
                    <key>postinstall_script</key>
                    <string>#!/bin/bash
# Write version receipt to reference in installcheck_script as pkg receipt has no version
RECEIPT="%RECEIPT_PATH%/Unity3D_macos_version.txt"
VERSION="%version%"

echo "$VERSION" &gt; "$RECEIPT"</string>
                    <key>postuninstall_script</key>
                    <string>#!/bin/bash
# Remove receipt
RECEIPT="%RECEIPT_PATH%/Unity3D_macos_version.txt"

if [ -f "$RECEIPT" ]; then
    rm "$RECEIPT"
fi</string>
                    <key>update_for</key>
                    <array>
                        <string>%UNITY_MUNKI_ITEM_NAME%-%version%</string>
                    </array>
                    <key>version</key>
                    <string>%version%</string>
                </dict>
            </dict>
            <key>Processor</key>
            <string>MunkiPkginfoMerger</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
