<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of OpenKiosk.</string>
	<key>Identifier</key>
	<string>com.github.apizz.download.OpenKiosk</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>OpenKiosk</string>
		<key>SEARCH_PATTERN</key>
		<string>(?P&lt;url&gt;https\:\/\/www\.mozdevgroup.com/[\w]+\/[\w.]+\/OpenKiosk60%20Release\/openkiosk-(?P&lt;version&gt;[\d.]+)-(?P&lt;date&gt;[\d-]+)\.dmg)</string>
		<key>SEARCH_URL</key>
		<string>http://openkiosk.mozdevgroup.com/</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.dmg</string>
				<key>re_pattern</key>
				<string>%SEARCH_PATTERN%</string>
				<key>url</key>
				<string>%SEARCH_URL%</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.dmg</string>
				<key>url</key>
				<string>%url%</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
