<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of iStudio Publisher.</string>
    <key>Identifier</key>
    <string>com.github.apizz.download.iStudioPublisher</string>
    <key>Input</key>
    <dict>
	<key>DOWNLOAD_URL</key>
	<string>https://www.istudiopublisher.com/downloadapp/iStudioPublisher.dmg</string>
	<key>NAME</key>
	<string>iStudioPublisher</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.0</string>
    <key>Process</key>
    <array>
	<dict>
	    <key>Arguments</key>
	    <dict>
		<key>filename</key>
		<string>%NAME%.dmg</string>
		<key>url</key>
		<string>%DOWNLOAD_URL%</string>
	    </dict>
	    <key>Processor</key>
	    <string>URLDownloader</string>
	</dict>
	<dict>
	    <key>Processor</key>
	    <string>EndOfCheckPhase</string>
	</dict>
	<dict>
	    <key>Arguments</key>
	    <dict>
	        <key>input_path</key>
		<string>%pathname%/iStudio Publisher.app</string>
		<key>requirement</key>
		<string>anchor apple generic and identifier "com.cfour.istudiopublisher" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = JZ94H4NG2P)</string>
	    </dict>
	    <key>Processor</key>
	    <string>CodeSignatureVerifier</string>
	</dict>
	<dict>
	    <key>Arguments</key>
	    <dict>
		<key>dmg_path</key>
		<string>%pathname%</string>
	    </dict>
	    <key>Processor</key>
	    <string>AppDmgVersioner</string>
	</dict>
    </array>
</dict>
</plist>
