<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest verison of GeoGebra Graphing Calculator.</string>
    <key>Identifier</key>
    <string>com.github.apizz.download.geogebragraphingcalculator</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>GeoGebra</string>
        <key>DOWNLOAD_URL</key>
	<string>https://download.geogebra.org/package/mac-graphing</string>
	<key>USER_AGENT</key>
        <string>Mozilla/5.0 (Macintosh; Intel Mac OS X 10_8_3) AppleWebKit/536.28.10 (KHTML, like Gecko) Version/6.0.3 Safari/536.28.10</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.3.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
	        <key>url</key>
	        <string>%DOWNLOAD_URL%</string>
	        <key>request_headers</key>
	        <dict>
	            <key>user-agent</key>
                    <string>%USER_AGENT%</string>
                </dict>
                <key>filename</key>
                <string>%NAME%.zip</string>
            </dict>
	    <key>Processor</key>
	    <string>URLDownloader</string>
        </dict>
	<dict>
	    <key>Processor</key>
	    <string>EndOfCheckPhase</string>
	</dict>
	<dict>
            <key>Arguments</key>
	    <dict>
	        <key>purge_destination</key>
		<true/>
            </dict>
	    <key>Processor</key>
            <string>Unarchiver</string>
        </dict>
        <dict>
            <key>Arguments</key>
	    <dict>
        	<key>dmg_root</key>
        	<string>%RECIPE_CACHE_DIR%/%NAME%</string>
        	<key>dmg_path</key>
        	<string>%RECIPE_CACHE_DIR%/%NAME%.dmg</string>
                <key>dmg_megabytes</key>
                <string>200</string>
            </dict>
	    <key>Processor</key>
            <string>DmgCreator</string>
        </dict>
    </array>
</dict>
</plist>
