<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Identifier</key>
    <string>com.github.apizz.munki.geogebragraphingcalculator</string>
    <key>Input</key>
    <dict>
        <key>MUNKI_CATEGORY</key>
	<string>Math</string>
	<key>MUNKI_REPO_SUBDIR</key>
	<string>apps/geogebra</string>
	<key>NAME</key>
	<string>GeoGebraGraphingCalculator</string>
	<key>pkginfo</key>
	<dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
	    <key>category</key>
	    <string>%MUNKI_CATEGORY%</string>
	    <key>description</key>
	    <string>Solve math problems, graph functions, create geometric constructions, do statistics and calculus, save and share your results.</string>
	    <key>developer</key>
	    <string>International GeoGebra Institute</string>
	    <key>display_name</key>
	    <string>GeoGebra Graphing Calculator</string>
	    <key>name</key>
	    <string>%NAME%</string>
	    <key>unattended_install</key>
	    <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.0</string>
    <key>ParentRecipe</key>
    <string>com.github.apizz.download.geogebragraphingcalculator</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/*.dmg</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
