<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of Dragonframe given the desired major version.</string>
    <key>Identifier</key>
    <string>com.github.apizz.download.Dragonframe</string>
    <key>Input</key>
    <dict>
        <key>MAJOR_VERSION</key>
        <string>3</string>
        <key>NAME</key>
        <string>Dragonframe</string>
  	<key>SEARCH_PATTERN</key>
	<string>(?P&lt;url&gt;http:\/\/www\.dragonframe.com\/download\/Dragonframe_(?P&lt;version&gt;%MAJOR_VERSION%.[\d.]+)\.pkg)</string>
	<key>SEARCH_URL</key>
	<string>http://www.dragonframe.com/downloads/</string>
    </dict>
    <key>Process</key>
    <array>
	<dict>
	    <key>Arguments</key>
	    <dict>
		<key>re_pattern</key>
		<string>%SEARCH_PATTERN%</string>
		<key>url</key>
		<string>%SEARCH_URL%</string>
	    </dict>
	    <key>Processor</key>
	    <string>URLTextSearcher</string>
	</dict>
	<dict>
	    <key>Arguments</key>
	    <dict>
		<key>filename</key>
		<string>%NAME%-%version%.pkg</string>
		<key>url</key>
		<string>%url%</string>
	    </dict>
	    <key>Processor</key>
	    <string>URLDownloader</string>
	</dict>
	<dict>
	    <key>Processor</key>
	    <string>EndOfCheckPhase</string>
	</dict>
	<dict>
	    <key>Arguments</key>
	    <dict>
	        <key>expected_authority_names</key>
		<array>
		    <string>Developer ID Installer: DZED Systems LLC</string>
		    <string>Developer ID Certification Authority</string>
		    <string>Apple Root CA</string>
		</array>
		<key>input_path</key>
		<string>%pathname%</string>
	    </dict>
	    <key>Processor</key>
	    <string>CodeSignatureVerifier</string>
	</dict>
    </array>
</dict>
</plist>
