<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Identifier</key>
    <string>com.github.apizz.munki.Dragonframe</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Dragonframe</string>
    </dict>
    <key>ParentRecipe</key>
    <string>com.github.apizz.download.Dragonframe</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
           	<key>pkg_path</key>
           	<string>%pathname%</string>
           	<key>repo_subdirectory</key>
           	<string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
