<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Identifier</key>
    <string>com.github.apizz.munki.Dragonframe</string>
    <key>Input</key>
    <dict>
        <key>MUNKI_CATEGORY</key>
		<string>Software</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps</string>
		<key>NAME</key>
		<string>Dragonframe</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>category</key>
			<string>%MUNKI_CATEGORY%</string>
			<key>description</key>
			<string>Begin your stop motion filmmaking journey today with the digital image capture software trusted by major motion picture studios and independent filmmakers alike.</string>
			<key>developer</key>
			<string>DZED Systems</string>
			<key>display_name</key>
			<string>Dragonframe</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
    </dict>
    <key>ParentRecipe</key>
    <string>com.github.apizz.download.Dragonframe</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
           	<key>pkg_path</key>
           	<string>%pathname%</string>
           	<key>repo_subdirectory</key>
           	<string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
