<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of RedisInsight. ARCH 'x64' = Intel; ARCH 'arm64' = Apple Silicon.</string>
    <key>Identifier</key>
    <string>com.github.apizz.download.RedisInsight</string>
    <key>Input</key>
    <dict>
        <key>ARCH</key>
        <string>x64</string>
        <key>NAME</key>
        <string>RedisInsight</string>
    </dict>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>%NAME%.dmg</string>
                <key>url</key>
                <string>https://s3.amazonaws.com/redisinsight.download/public/latest/Redis-Insight-mac-%ARCH%.dmg</string>
            </dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/Redis Insight.app</string>
                <key>requirement</key>
                <string>identifier "org.RedisLabs.RedisInsight-V2" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = UUK47G4BAZ</string>
                <key>strict_verification</key>
                <true/>
            </dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
        </dict>
    </array>
</dict>
</plist>
