<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest release version of Pencil2D and imports into Munki.</string>
    <key>Identifier</key>
    <string>com.github.apizz.munki.Pencil2D</string>
    <key>Input</key>
    <dict>
      <key>MUNKI_CATEGORY</key>
      <string>Video</string>
      <key>MUNKI_REPO_SUBDIR</key>
      <string>apps/pencil2d</string>
      <key>NAME</key>
      <string>Pencil2D</string>
      <key>pkginfo</key>
      <dict>
        <key>catalogs</key>
        <array>
          <string>testing</string>
        </array>
        <key>category</key>
        <string>%MUNKI_CATEGORY%</string>
        <key>developer</key>
        <string>Pencil2D Animation</string>
        <key>description</key>
        <string>An easy, intuitive tool to make 2D hand-drawn animations.</string>
        <key>display_name</key>
        <string>Pencil2D Animation</string>
        <key>name</key>
        <string>%NAME%</string>
        <key>unattended_install</key>
        <true/>
      </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0</string>
    <key>ParentRecipe</key>
    <string>com.github.apizz.download.Pencil2D</string>
    <key>Process</key>
    <array>
      <dict>
        <key>Processor</key>
        <string>Unarchiver</string>
      </dict>
      <dict>
        <key>Arguments</key>
        <dict>
          <key>dmg_path</key>
          <string>%RECIPE_CACHE_DIR%/%NAME%-%version%.dmg</string>
          <key>dmg_root</key>
          <string>%RECIPE_CACHE_DIR%/%NAME%/%NAME%</string>
        </dict>
        <key>Processor</key>
        <string>DmgCreator</string>
      </dict>
      <dict>
        <key>Arguments</key>
        <dict>
          <key>pkg_path</key>
          <string>%dmg_path%</string>
          <key>repo_subdirectory</key>
          <string>%MUNKI_REPO_SUBDIR%</string>
        </dict>
        <key>Processor</key>
        <string>MunkiImporter</string>
      </dict>
      <dict>
        <key>Arguments</key>
        <dict>
          <key>path_list</key>
          <array>
            <string>%RECIPE_CACHE_DIR%/%NAME%</string>
          </array>
        </dict>
        <key>Processor</key>
        <string>PathDeleter</string>
      </dict>
    </array>
</dict>
</plist>
