<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Identifier</key>
    <string>com.github.apizz.munki.loggerpro_license</string>
    <key>Input</key>
    <dict>
	<key>MUNKI_CATEGORY</key>
	<string>Software</string>
	<key>MUNKI_REPO_SUBDIR</key>
	<string>apps</string>
	<key>NAME</key>
	<string>LoggerPro</string>
	<key>pkginfo</key>
	<dict>
	    <key>catalogs</key>
	    <array>
		<string>testing</string>
	    </array>
	    <key>category</key>
	    <string>%MUNKI_CATEGORY%</string>
	    <key>description</key>
	    <string>Logger Pro is award-winning, data-collection and analysis software for Windows and Mac computers.</string>
	    <key>developer</key>
	    <string>Vernier Software &amp; Technology, LLC.</string>
	    <key>display_name</key>
	    <string>LoggerPro 3</string>
	    <key>name</key>
	    <string>%NAME%</string>
	    <key>unattended_install</key>
	    <true/>
	</dict>
    </dict>
    <key>ParentRecipe</key>
    <string>com.github.apizz.pkg.loggerpro_license</string>
    <key>Process</key>
    <array>
	<dict>
            <key>Arguments</key>
            <dict>
           	<key>pkg_path</key>
           	<string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
           	<key>repo_subdirectory</key>
           	<string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
