<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of Adobe's Shockwave Player and imports into a munki_repo.</string>
    <key>Identifier</key>
    <string>com.github.apizz.munki.AdobeShockwavePlayer</string>
    <key>Input</key>
    <dict>
        <key>DOWNLOAD_URL</key>
        <string>https://fpdownload.macromedia.com/get/shockwave/default/english/macosx/latest/Shockwave_Installer_Full_64bit.dmg</string>
        <key>MUNKI_CATEGORY</key>
        <string>Plugins</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>plugins</string>
        <key>NAME</key>
        <string>AdobeShockwavePlayer</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>category</key>
            <string>%MUNKI_CATEGORY%</string>
            <key>description</key>
            <string>Adobe Shockwave is a multimedia platform for building interactive multimedia applications and video games. Developers originate content using Adobe Director and publish it on the Internet.</string>
            <key>developer</key>
            <string>Adobe Systems Inc.</string>
            <key>display_name</key>
            <string>Adobe Shockwave Player</string>
            <key>minimum_os_version</key>
            <string>10.5.0</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>ParentRecipe</key>
    <string>com.github.novaksam.pkg.AdobeShockwavePlayer</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
